#ifndef __CPARSING_ANSI_H__
#define __CPARSING_ANSI_H__

////////////////////////////////////////////////////////////////////////////////////////////////////
// 메모리를 언제 해제해야 하는가?
//  -> 직접 함수를 호출하여 해제한다.
//	-> 만약 소멸자에 메모리 해제를 넣는다면, 다른 파일을 불러올 때 마다 소멸자를 호출해야 한다. 
// 
////////////////////////////////////////////////////////////////////////////////////////////////////
class CParsing_ANSI
{
private:
	unsigned char* _readBuffer;					// 버퍼의 시작 주소
	unsigned char* _tempBuffer;					// 버퍼 주소 복사, 이것을 사용한다.
	unsigned char* _pLastAddressBuffer;			// 버퍼의 마지막 주소 +1


public:
	CParsing_ANSI();
	~CParsing_ANSI();

private:
	//---------------------------------------------------------------------------------------------------
//  "//", "/* */" 두개를 주석으로 구분한다.
// 
//---------------------------------------------------------------------------------------------------
	bool SkipNoneCommand(unsigned char** ucppBuffer);

	//---------------------------------------------------------------------------------------------------
	// 다음 단어 얻기.
	// 
	// Parameters: (char **) 다음 단어의 시작 위치(받음), (int *) 다음 단어의 길이(받음)
	// Return: (BOOL)TRUE, FALSE,
	// 
	//---------------------------------------------------------------------------------------------------
	bool GetNextWord(unsigned char** ucppBuffer, int* ipLength);


	//---------------------------------------------------------------------------------------------------
	// value를 얻는다. value의 경우 마지막에 ; 로 끝남
	// 
	//---------------------------------------------------------------------------------------------------
	bool GetNextValue(unsigned char** ucppBuffer, int* ipLength);

public:
	//---------------------------------------------------------------------------------------------------
	// malloc을 사용하여 메모리를 할당한다. 
	// 
	//---------------------------------------------------------------------------------------------------
	void LoadFile(const char* cchpFileName);
	bool GetValue(const char* key, int* ipValue);
	bool GetValue(const char* key, double* fpValue);
	bool GetValue(const char* key, char* cpValue);
	bool GetValue(const char* key, char cpValue[], int iSize);

};


#endif // !__CPARSING_ANSI_H__

