
#ifndef __CONSOLE_H__
#define __CONSOLE_H__

#define dfSCREEN_WIDTH 80 + 1 + 1
#define dfSCREEN_HEIGHT 24 + 1

//--------------------------------------------
// 콘솔 제어를 위한 준비 작업
//--------------------------------------------
void cs_Initial(void);

//-----------------------------------------------------
// 콘솔 화면의 커서를 Y, X 좌표로 이동시킨다.
//
//-----------------------------------------------------
void cs_MoveCursor(int iPosY, int iPosX);

//--------------------------------------------
// 콘솔 화면을 초기화 한다. 
//--------------------------------------------
void cs_ClearScreen(void);

#endif // !__CONSOLE_H__
