#ifndef __ENEMY_H__
#define __ENEMY_H__

#define MAX_ENEMY				20
#define MAX_MOVING_PATTERN		50
#define MAX_SHOT_ONE			5
#define MAX_ENEMY_BULLET		200

struct st_ENEMY
{
	bool bVisible;

	int iHp;

	char cEnemySkin;

	int iY;
	int iX;

	int iBeforeY;		// 움직이기 전 위치를 저장한다.		2프레임 이상 움직일 경우 충돌 판정을 위하여 저장한다.
	int iBeforeX;		// 

	///////////////////////////////////////////////////////
	// 적의 움직임 
	// 
	///////////////////////////////////////////////////////
	int iMaxMovingPattern;							// 움직임의 갯수
	int iNextPattern;								// 다음 움직임


	int iDireY[MAX_MOVING_PATTERN];					// 움직임 상대 좌표, 움직이는 속도
	int iDireX[MAX_MOVING_PATTERN];					//  
	int iMovingCoolTime[MAX_MOVING_PATTERN];		// 움직임에 대한 쿨타임, 




	///////////////////////////////////////////////////////
	// 적이 생성하는 총알
	// 
	///////////////////////////////////////////////////////
	int iShotOne;									// 한번에 쏠 총알의 수
	
	char cBulletSkin[MAX_SHOT_ONE];					// 총알 모양

	int iDamage[MAX_SHOT_ONE];						// 총알의 데미지

	int iBulletDireY[MAX_SHOT_ONE];					// 총알이 날아가는 방향, 날아가는 속도
	int iBulletDireX[MAX_SHOT_ONE];					//

	int iBulletCoolTime[MAX_SHOT_ONE];				// 총알의 연사 속도
	int iBulletSpeed[MAX_SHOT_ONE];					// 총알의 속도
};

struct st_ENEMY_BULLET
{
	bool bVisible;

	char cBulletSkin;

	int iDamage;

	int iY;
	int iX;

	int iDireY;
	int iDireX;

	int iSpeed;
};




///////////////////////////////////////////////////////
// 적 
// 
///////////////////////////////////////////////////////
// ----------------------------------------------------
// 적 정보를 불러온다.
// 
// ----------------------------------------------------
bool enmy_Is_GetStage(const char* cEnemyInfo);

// ----------------------------------------------------
// 적의 이동
// 
// ----------------------------------------------------
void enmy_Move_Enemy(void);

//---------------------------------------------------------------------------------
// 적과 충동판정
// 
//---------------------------------------------------------------------------------
bool enmy_Is_Hit(int iY, int iX, int iDamage);

//---------------------------------------------------------------------------------
// 스크린 버퍼에 적을 그린다.
// 
//---------------------------------------------------------------------------------
void enmy_Draw_Enemy(void);

//---------------------------------------------------------------------------------
// 적이 다 죽어서 이겼는지 확인한다.
// 
//---------------------------------------------------------------------------------
bool enmy_Is_Win(void);





///////////////////////////////////////////////////////
// 총알
// 
///////////////////////////////////////////////////////
//---------------------------------------------------------------------------------
// 총알 발싸
// 
//---------------------------------------------------------------------------------
void enmy_Shoot_Bullet(void);

//---------------------------------------------------------------------------------
// 총알 이동
// 
//---------------------------------------------------------------------------------
void enmy_Move_Bullet(void);

//---------------------------------------------------------------------------------
// 적 총알과 플레이어와 충돌 확인
// 
//---------------------------------------------------------------------------------
void enmy_Bullet_Hit_Player(void);

//---------------------------------------------------------------------------------
// 스크린 버퍼에 총알을 그린다.
// 
//---------------------------------------------------------------------------------
void enmy_Draw_Enemy_Bullet(void);





#endif // !__ENEMY_H__
